app/views/users/show.html.erb

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1
---
  	<%= render 'users/info' %>
    <% if @user.microposts.any? %>