app/controllers/static_pages_controller.rb

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1
---
  def home
  @micropost = current_user.microposts.build if signed_in?
  @feed_items = current_user.feed.paginate(page: params[:page]) if signed_in?