app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id] )
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("admin", "bio", "birthday", "city", "country", "created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)